Revit 2026 API

# DirectShapeSetOptions Method

---

Sets the options to use for this DirectShape.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetOptions(
	DirectShapeOptions options
)
```
```vb
Public Sub SetOptions (
	options As DirectShapeOptions
)
```
```cpp
public:
void SetOptions(
	DirectShapeOptions^ options
)
```
```fsharp
member SetOptions :
        options : DirectShapeOptions -> unit
```

#### Parameters

options DirectShapeOptions
     Options to use for this DirectShape.

| Exception | Condition |
| --- | --- |
| ArgumentException | The DirectShapeOptions provided are not valid for this DirectShape. -or- The DirectShapeOptions provided are not valid for this transient DirectShape. |
| ArgumentNullException | A non-optional argument was null |

The new options take effect immediately. If this DirectShape relies on a DirectShapeType for references, the options stored in DirectShapeType take precedence. Note that changing options affects how the object interacts with Revit. E.g., switching references off will disable existing constraints applied to that object.

#### Reference

DirectShape Class

Autodesk.Revit.DB Namespace